In [93]:
import pandas as pd
df=pd.read_csv("C:\pandas_experiment\pandas_sorting\data1.csv") 
df

   EmpID   Salary       Skill
0     21  15000.0      Python
1     12      NaN      python
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON

### Sorting values by one column "EmpID"

In [30]:
df.sort_values('EmpID')

   EmpID   Salary       Skill
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
1     12      NaN      python
2     15   5000.0  JavaScript
0     21  15000.0      Python

### Sorting values by one column "EmpID" in descending order

In [31]:
df.sort_values('EmpID',ascending=False)

   EmpID   Salary       Skill
0     21  15000.0      Python
2     15   5000.0  JavaScript
1     12      NaN      python
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript

### Sorting values based on two columns "Skill" and "EmpID"

In [32]:
df.sort_values(by=['Skill','EmpID'])

   EmpID   Salary       Skill
3      7  12000.0  JavaScript
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

### Sorting dataframe by one column "Skill"

In [27]:
df.sort_values(by=['Skill'])

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python


### Sorting dataframe by two column in two different order

In [28]:
df.sort_values(by=['Skill','EmpID'],ascending=[True,False])

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

### Sorting dataframe by putting NaN values first

In [38]:

df.sort_values("Salary",na_position='first')

   EmpID   Salary       Skill
1     12      NaN      python
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript
0     21  15000.0      Python

### Sorting in place

In [48]:

df.sort_values("Salary",inplace=True)
df

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript
0     21  15000.0      Python
1     12      NaN      python

### Sorting by ignoring index

In [49]:
df.sort_values("Salary",ignore_index=True)

   EmpID   Salary       Skill
0     15   5000.0  JavaScript
1     10  10000.0      PYTHON
2      7  12000.0  JavaScript
3     21  15000.0      Python
4     12      NaN      python

### Sorting dataframe by applying key function

In [66]:
df.sort_index(inplace=True)

In [68]:
df.sort_values(by=["Skill"],key=lambda x:x.str.lower())

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
0     21  15000.0      Python
1     12      NaN      python
4     10  10000.0      PYTHON

In [69]:
df.sort_values(by=["Skill"])

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

In [79]:
df.sort_values(by=["Skill"],key=lambda x:x.str.len())

   EmpID   Salary       Skill
0     21  15000.0      Python
1     12      NaN      python
4     10  10000.0      PYTHON
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript

### Sorting dataframe by row values

In [82]:
df = pd.DataFrame(data={'x':[10,30,20], 'y':[1,2,3],'z':[5,15,10]})
df

    x  y   z
0  10  1   5
1  30  2  15
2  20  3  10

In [83]:
df.sort_values(by=0,axis=1)

   y   z   x
0  1   5  10
1  2  15  30
2  3  10  20

In [89]:
df1 = pd.DataFrame(data={'x':[10,10,"d"], 'y':['a',5,'c'],'z':[5,15,'a']})
df1

    x  y   z
0  10  a   5
1  10  5  15
2   d  c   a

In [91]:
df1.sort_values(by=1,axis=1)

   y   x   z
0  a  10   5
1  5  10  15
2  c   d   a

In [92]:
df1.sort_values(by=2,axis=1)

    z  y   x
0   5  a  10
1  15  5  10
2   a  c   d